#global, local 심벌 테이블

g_a = 1
g_s = '둘리'

def g_f():
    l_a = 2
    l_s = '마이콜'
    print(locals())

print("=======================Global symbol table vs Local symbol Table==========================")
print(globals())
g_f()

print(g_a)

#에러 : local symbol table은 함수 실행이 끝나면 사라진다
#print(l_a)


#01. 사용자 정의 함수
print("=======================01. 사용자 정의 함수==========================")
# 심벌테이블 ㅇ, 확장 ㅇ
g_f.n = 'Hello'
g_f.i = 10
print(g_f.__dict__)

#사용자정의 클래스
print("=======================02. 사용자정의 클래스==========================")
# 심벌테이블 ㅇ, 확장 ㅇ
class MyClass:
    x = 10
    y = 10

MyClass.z =30
print(MyClass.__dict__)


print("=======================03. 내장 함수==========================")
#print.z = 10
# 심벌테이블 x, 확장 x
print(print.__dict)



print("=======================04. 내장 클래스==========================")
#심벌테이블 ㅇ, 확장x
#str.z = 10
print(str.__dict__)



print("=======================05. 사용자 정의 클래스로 생성된 객체==========================")
# 심벌테이블 ㅇ, 확장ㅇ
o = MyClass()
o.z = 10
print(o.__dict__)



print("=======================06. 내장 클래스로 생성된 객체==========================")
#심벌테이블 x, 확장 x
# g_a.z = 10
# print(g_a.__dict__)











